micro-os-plus/micro-os-plus-ii/packages/hal/architecture/arm/cortexm/stm32f/include/InterruptNumbers.h
//
// This file is part of the µOS++ SE distribution.
// Copyright (c) 2013 Liviu Ionescu.
//

#ifndef HAL_ARCHITECTURE_ARM_CORTEXM_STM32F_INTERRUPTNUMBERS_H_
#define HAL_ARCHITECTURE_ARM_CORTEXM_STM32F_INTERRUPTNUMBERS_H_

#include "portable/core/include/ConfigDefines.h"

#if defined(OS_INCLUDE_HAL_MCU_FAMILY_STM32F) || defined(__DOXYGEN__)

#include "portable/core/include/OS.h"

#include "hal/architecture/arm/cortexm/include/CoreInterruptNumbers.h"

namespace hal
{
  namespace stm32f10x
  {
    /// \ingroup stm32f1x
    /// \headerfile InterruptNumbers.h "hal/architecture/arm/cortexm/include/InterruptNumbers.h"
    /// \nosubgrouping
    ///
    /// \brief STM32F10X family interrupt numbers
    class InterruptNumberBase : public hal::cortexm::CortexM3InterruptNumber
    {
    public:
      //InterruptNumberBase() = delete;

      /// \name Interrupt numbers
      /// @{

      /// Window WatchDog Interrupt
      static const InterruptNumber_t WWDG = 0;
      /// PVD through EXTI Line detection Interrupt
      static const InterruptNumber_t PVD = 1;
      /// Tamper Interrupt
      static const InterruptNumber_t TAMPER = 2;
      /// RTC global Interrupt
      static const InterruptNumber_t RTC = 3;
      /// FLASH global Interrupt
      static const InterruptNumber_t FLASH = 4;
      /// RCC global Interrupt
      static const InterruptNumber_t RCC = 5;
      /// EXTI Line0 Interrupt
      static const InterruptNumber_t EXTI0 = 6;
      /// EXTI Line1 Interrupt
      static const InterruptNumber_t EXTI1 = 7;
      /// EXTI Line2 Interrupt
      static const InterruptNumber_t EXTI2 = 8;
      /// EXTI Line3 Interrupt
      static const InterruptNumber_t EXTI3 = 9;
      /// EXTI Line4 Interrupt
      static const InterruptNumber_t EXTI4 = 10;
      /// DMA1 Channel 1 global Interrupt
      static const InterruptNumber_t DMA1_Channel1 = 11;
      /// DMA1 Channel 2 global Interrupt
      static const InterruptNumber_t DMA1_Channel2 = 12;
      /// DMA1 Channel 3 global Interrupt
      static const InterruptNumber_t DMA1_Channel3 = 13;
      /// DMA1 Channel 4 global Interrupt
      static const InterruptNumber_t DMA1_Channel4 = 14;
      /// DMA1 Channel 5 global Interrupt
      static const InterruptNumber_t DMA1_Channel5 = 15;
      /// DMA1 Channel 6 global Interrupt
      static const InterruptNumber_t DMA1_Channel6 = 16;
      /// DMA1 Channel 7 global Interrupt
      static const InterruptNumber_t DMA1_Channel7 = 17;

      /// @}

    };
  }
}

namespace hal
{
  namespace stm32f10xld
  {
    /// \ingroup stm32f10xld
    /// \headerfile InterruptNumbers.h "hal/architecture/arm/cortexm/include/InterruptNumbers.h"
    /// \nosubgrouping
    ///
    /// \brief STM32F10X_LD family interrupt numbers
    class InterruptNumber : public hal::stm32f10x::InterruptNumberBase
    {
    public:
      //InterruptNumber() = delete;

      /// \name Interrupt numbers
      /// @{

      static const InterruptNumber_t ADC1_2 = 18; ///< ADC1 and ADC2 global Interrupt
      static const InterruptNumber_t USB_HP_CAN1_TX = 19; ///< USB Device High Priority or CAN1 TX Interrupts
      static const InterruptNumber_t USB_LP_CAN1_RX0 = 20; ///< USB Device Low Priority or CAN1 RX0 Interrupts
      static const InterruptNumber_t CAN1_RX1 = 21;      ///< CAN1 RX1 Interrupt
      static const InterruptNumber_t CAN1_SCE = 22;      ///< CAN1 SCE Interrupt
      static const InterruptNumber_t EXTI9_5 = 23; ///< External Line[9:5] Interrupts
      static const InterruptNumber_t TIM1_BRK = 24;    ///< TIM1 Break Interrupt
      static const InterruptNumber_t TIM1_UP = 25;    ///< TIM1 Update Interrupt
      static const InterruptNumber_t TIM1_TRG_COM = 26; ///< TIM1 Trigger and Commutation Interrupt
      static const InterruptNumber_t TIM1_CC = 27; ///< TIM1 Capture Compare Interrupt
      static const InterruptNumber_t TIM2 = 28;      ///< TIM2 global Interrupt
      static const InterruptNumber_t TIM3 = 29;      ///< TIM3 global Interrupt
      static const InterruptNumber_t I2C1_EV = 31;     ///< I2C1 Event Interrupt
      static const InterruptNumber_t I2C1_ER = 32;     ///< I2C1 Error Interrupt
      static const InterruptNumber_t SPI1 = 35;      ///< SPI1 global Interrupt
      static const InterruptNumber_t USART1 = 37;   ///< USART1 global Interrupt
      static const InterruptNumber_t USART2 = 38;   ///< USART2 global Interrupt
      static const InterruptNumber_t EXTI15_10 = 40; ///< External Line[15:10] Interrupts
      static const InterruptNumber_t RTCAlarm = 41; ///< RTC Alarm through EXTI Line Interrupt
      static const InterruptNumber_t USBWakeUp = 42; ///< USB Device WakeUp from suspend through EXTI Line Interrupt

      /// @}

    };
  }
}

namespace hal
{
  namespace stm32f10xldvl
  {
    /// \ingroup stm32f10xldvl
    /// \headerfile InterruptNumbers.h "hal/architecture/arm/cortexm/include/InterruptNumbers.h"
    /// \nosubgrouping
    ///
    /// \brief STM32F10X_LD_VL family interrupt numbers
    class InterruptNumber : public hal::stm32f10x::InterruptNumberBase
    {
    public:
      //InterruptNumber() = delete;

      static const InterruptNumber_t ADC1 = 18; ///< ADC1 global Interrupt
      static const InterruptNumber_t EXTI9_5 = 23; ///< External Line[9:5] Interrupts
      static const InterruptNumber_t TIM1_BRK_TIM15 = 24; ///< TIM1 Break and TIM15 Interrupts
      static const InterruptNumber_t TIM1_UP_TIM16 = 25; ///< TIM1 Update and TIM16 Interrupts
      static const InterruptNumber_t TIM1_TRG_COM_TIM17 = 26; ///< TIM1 Trigger and Commutation and TIM17 Interrupt
      static const InterruptNumber_t TIM1_CC = 27; ///< TIM1 Capture Compare Interrupt
      static const InterruptNumber_t TIM2 = 28; ///< TIM2 global Interrupt
      static const InterruptNumber_t TIM3 = 29; ///< TIM3 global Interrupt
      static const InterruptNumber_t I2C1_EV = 31; ///< I2C1 Event Interrupt
      static const InterruptNumber_t I2C1_ER = 32; ///< I2C1 Error Interrupt
      static const InterruptNumber_t SPI1 = 35; ///< SPI1 global Interrupt
      static const InterruptNumber_t USART1 = 37; ///< USART1 global Interrupt
      static const InterruptNumber_t USART2 = 38; ///< USART2 global Interrupt
      static const InterruptNumber_t EXTI15_10 = 40; ///< External Line[15:10] Interrupts
      static const InterruptNumber_t RTCAlarm = 41; ///< RTC Alarm through EXTI Line Interrupt
      static const InterruptNumber_t CEC = 42; ///< HDMI-CEC Interrupt
      static const InterruptNumber_t TIM6_DAC = 54; ///< TIM6 and DAC underrun Interrupt
      static const InterruptNumber_t TIM7 = 55; ///< TIM7 Interrupt
    };
  }
}

namespace hal
{
  namespace stm32f10xmd
  {
    /// \ingroup stm32f10xmd
    /// \headerfile InterruptNumbers.h "hal/architecture/arm/cortexm/include/InterruptNumbers.h"
    /// \nosubgrouping
    ///
    /// \brief STM32F10X_MD devices interrupt numbers
    class InterruptNumber : public hal::stm32f10x::InterruptNumberBase
    {
    public:
      //InterruptNumber() = delete;

